{
  "lastUpdated": "2025-12-13T20:03:13.414Z",
  "programs": [
    {
      "name": "Sectors and Tailored funding Products",
      "summary": "To view more information about our regional presence, hover over the map and click on a province >>",
      "source": "https://www.idc.co.za/",
      "eligibility": "y for. Let’s find out what fund you qualify for. START HERE STEP 2 GET ORGANISED Gather all the required documents you will need in order to complete your",
      "fundingAmount": "R1 34; R31 Million; R2.8 million; R1.5; R1.5 million",
      "deadlines": "25 November 2025; 23 February 2024; open; continuous",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "2.0; 4.; 2.8 million Jagersfontein Relief Efforts The Industrial Development Cor; 1.5m Emergency Relief Items to Ashraful Aid KZN Appeal Ashraful Aid International Hum; 1.5 million upgrades sponsored by the IDC Principal Puleng Mogale and he",
      "sectors": "innovation, agriculture, mining, manufacturing, construction, energy, transport, tourism, services, finance"
    },
    {
      "name": "Welcome to the NYDA",
      "summary": "The National Youth Development Agency (NYDA) is a South African-based agency established primarily...",
      "source": "https://www.nyda.gov.za/",
      "eligibility": "",
      "fundingAmount": "",
      "deadlines": "Open; open",
      "contactEmail": "info@nyda.gov.za",
      "contactPhone": "0820301668",
      "applicationProcess": "2.0 (the \"License\"); you may not * use this file except in compliance with the License; 2.0 * * Unless required by applicable law or agreed to in writing, software * distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT * WARRANTIES OR CONDITIONS OF ANY KIND, either exp; 1.6; 2.0 */(function(){function aa(a,b,c){return a; 1.6666666666667px;}} #side-panel,",
      "sectors": ""
    },
    {
      "name": "Programmes | Department of Small Business Development",
      "summary": "CO-OPERATIVE DEVELOPMENT SUPPORT PROGRAMME:",
      "source": "https://www.dsbd.gov.za/programmes",
      "eligibility": "",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "",
      "sectors": "small business, enterprise, manufacturing"
    },
    {
      "name": "Small Enterprise Manufacturing Support Programme | Department of Small Business Development",
      "summary": "The purpose of the Small Enterprise Manufacturing Support Programme is:",
      "source": "https://www.dsbd.gov.za/programme/small-enterprise-manufacturing-support-programme",
      "eligibility": "",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "",
      "sectors": "enterprise, manufacturing, tech, technology, agricultural"
    },
    {
      "name": "Co-Operatives Development Support Programme (CDSP) | Department of Small Business Development",
      "summary": "CO-OPERATIVE DEVELOPMENT SUPPORT PROGRAMME:",
      "source": "https://www.dsbd.gov.za/programme/co-operatives-development-support-programme-cdsp",
      "eligibility": "ying activities‭. ‬The grant support is available for machinery‭, ‬equipment‭, ‬infrastructure‭, ‬commercial vehicles and business development support necessary to grow co-operative enterprises to ensure that the co-operative enterprise develop to be more sustainable and competitive‭.‬",
      "fundingAmount": "R2.5",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "2.5‭ ‬million towards qualifying activities‭; APPLICATION PROCESS‭ ‬ Proof of Registration on the National SMME Database‭: ‬https‭://‬smmesa; Complete the simplified online application form available from www; submit a sworn affidavit regarding support received from the State in the five-year period preceding the application‭",
      "sectors": "small business, enterprise"
    },
    {
      "name": "Small Enterprise Manufacturing Support Programme | Department of Small Business Development",
      "summary": "https://www.dsbd.gov.za/programme/small-enterprise-manufacturing-support-programme",
      "source": "https://www.dsbd.gov.za/article/small-enterprise-manufacturing-support-programme",
      "eligibility": "",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "",
      "sectors": "enterprise, manufacturing"
    },
    {
      "name": "Local Government Support",
      "summary": "The local government sector is an investment area where the DBSA holds extensive expertise and we work with all three sectors of local government i.e. metros, secondary and under-resourced municipalities. ..",
      "source": "https://www.dbsa.org/sectors/local-government-support",
      "eligibility": "",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "webmaster@dbsa.org",
      "contactPhone": "+27 11 313 3911",
      "applicationProcess": "secondary and under-resourced municipalities; secondary market liquidity through expanding available issuances, and encouraging innovation in lending instruments; 5.9405299 28",
      "sectors": "services, innovation, finance"
    },
    {
      "name": "Infrastructure Fund",
      "summary": "The Infrastructure Fund is currently housed within the Development Bank of Southern Africa (DBSA). The Infrastructure Fund’s mandate has been captured in a tripartite Memorandum of Agreement signed in August 2020 by National Treasury, the Department of Public Works and Infrastructure:...",
      "source": "https://www.dbsa.org/solutions/infrastructure-fund",
      "eligibility": "of the National Development Plan. Create a sustainable infrastructure development ecosystem. Accelerate and scale-up catalytic infrastructure development and implementation by supporting project owners. Address market failures to improve bankability through innovative structured solutions. Maximize participation by the private sector, institutional investors, development finance institutions and multilateral development banks.",
      "fundingAmount": "R100billion; R18billion; R4billion; R6billion; R8billion",
      "deadlines": "",
      "contactEmail": "webmaster@dbsa.org",
      "contactPhone": "+27 11 313 3911",
      "applicationProcess": "secondary agriculture; 5.9405299 28",
      "sectors": "finance, education, healthcare, energy, technology, transport, agriculture"
    },
    {
      "name": "START WITH DBSA",
      "summary": "Start building your future from Day 1, in a company where you'll be valued, recognised and respected.",
      "source": "https://www.dbsa.org/start-dbsa-graduate-programme",
      "eligibility": "A DAY IN THE LIFE OF WIL LEARNER LISTEN TO WHAT THE PROGRAMME MANAGER HAS TO SAY INTERNAL AUDIT PROGRAMME JOIN OUR TEAM OF INTERNAL AUDITORS CRITERIA LISTEN TO WHAT THE TRAINEES HAVE TO SAY LISTEN TO WHAT THE PROGRAMME MANAGER HAS TO SAY wraper_elements LEARNERSHIPS THERE'S NO BETTER PLACE TO GAIN WORK EXPERIENCE",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "TO APPLY FOR? GRADUATE PROGRAMME (CLOSED) WIL PROGRAMME (CLOSED) INTERNAL AUDIT PROGRAMME (CLOSED) LEARNERSHIPS (CLOSED) WINTER SCHOOL (CLOSED) CANT FIND WHAT YOU ARE LOOKING FOR -  FOR FURTHER ENGAGEMENT pro",
      "sectors": ""
    },
    {
      "name": "Welcome to GEP",
      "summary": "The Gauteng Enterprise Propeller (GEP) promotes, fosters and develops small enterprises in Gauteng thereby implementing the policy of the Gauteng Provincial Government for small enterprise development.",
      "source": "https://www.gep.co.za/",
      "eligibility": "",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "",
      "sectors": "enterprise"
    },
    {
      "name": "Financial Support",
      "summary": "Our financial support products include:",
      "source": "https://www.gep.co.za/what-we-do/financial-support/",
      "eligibility": "ication criteria for loans. Our financial support products include: Start-up Finance Contract Finance. Growth Finance Franchise Finance GEP Micro-finance *Applicants for contract finance are allowed more than one",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "APPLICATION PROCESS All applications for funding are done online using the GEP Online Application System; how to apply online GEP Financial Support  Township Economy Partnership Fund  SMME CRISIS PARTNERSHIP Fund  Gauteng Rebuild Fund  Partnership Marketing and Sponsorship",
      "sectors": "enterprise, services, finance"
    },
    {
      "name": "Non-financial Support",
      "summary": "Gauteng Enterprise Propeller provides business development support interventions that play a catalytic role in transforming SMMEs, Co-operatives and Informal Traders towards being sustainable businesses.",
      "source": "https://www.gep.co.za/what-we-do/non-financial-support/",
      "eligibility": "",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "provides business development support interventions that play a catalytic role in transforming SMMEs, Co-operatives and Informal Traders towards being sustainable businesses. The Non-Financial support program is offered through the Regional Offices and includes: Gauteng’s revitalised township economies contributing to shared economic growth and development Gauteng’s SMMEs and Co-operatives actively participating in the province’s mainstream economy, including in the key economic sectors. Township Economies Revitalisation (TER) and Gauteng Informal Business Upliftment Strategy (GIBUS) projects effectively implemented. Non-Financial Support Programmes Accredited Training offered by accredited training providers In-house Training/Workshop offered by GEP officials Training by Corporate Partners offered through strategic partnerships Our training interventions include: Cooperatives Governance Business Plan Development Pricing and Costing Sales and Marketing Business Management Skills Bookkeeping Skills Financial Literacy skills Tendering Skills Entrepreneurship Skills Business Development Support Interventions PLANNING SUPPORT INTERVENTIONS Business plan Business expansion plan Business turnaround plan Productivity improvement plan Accounting / Bookkeeping Preparation of budgets Setting up debtors / creditors system Setting up a Stock Control System Costing & Pricing Cash Flow Management System Electronic Financial Management System Manual Financial Management System Marketing plan & strategy Printed Marketing Material (Can include Company logo, business cards, brochures, pamphlets, catalogues, magnetic car stickers, sign boards, street pole adds, document folders, letterheads, product labels)",
      "sectors": "enterprise, finance"
    },
    {
      "name": "Overview",
      "summary": "Ithala’s Business Finance Unit is responsible for facilitating the development and empowerment of KwaZulu-Natal-based business enterprises, in addition must be promote job creation in the province.",
      "source": "https://www.ithala.co.za/business-finance/",
      "eligibility": "Business must be registered with CIPC or properly constituted Partnership, Trust or Sole Proprietor.Members/",
      "fundingAmount": "",
      "deadlines": "open",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "first year reflected monthly)Latest Management Accounts (Income Statement, Balance Sheet and Cash Flow Statement with notes)Debtors and Creditors Age Analysis as at Management account dateBreakdown of inco; provide a valid tax clearance certificate.Main business operations or primary place of business must be within KZNBusiness impact must benefit KZN economy or people domiciled in KZN;Good standing with existing creditors.The business’s economic activity must have a demonstrable socio-economic impact.The business or project must demonstrate financial viability.The members/shareholders of the business must not be un-rehabilitated insolvent and not be under debt review or administration orderThe business must not be engaged in any illegal activity.At least one partner, member or shareholder must be involved in the management of the business at senior or executive level. Funding Requirements FICACopy of Identity documents of all members/spouses/shareholders/directors Proof of residential and postal address for members/shareholders/directors not older than 3 monthsProof of Business address not older than 3 months; completed affidavit/share certificatesOrganizational Chart and Shareholding OrganogramRelevant License/ Permits to operate in said industryCVs on all members/shareholders/directors/key staffOriginal Valid Tax Clearance CertificateComprehensive business plan / Business ProfileBEE CertificateFINANCIAL DOCS Financial Statements of your existing business (es) for the last three years (if applicable) Cash flow projections for 5 years, including income statement and balance sheet (first year reflected monthly)Latest Management Accounts (Income Statement, Balance Sheet and Cash Flow Statement with notes)Debtors and Creditors Age Analysis as at Management account dateBreakdown of income sourcesLatest Twelve months’ Original Bank Statements of businesstrading account (Bank Stamped)Statements at management account date for all liabilitiesOTHER Original completed Ithala Application forms signed by each member/shareholder/directorList of equipment to be financed and a breakdown of the utilization of the finance (2 quotations to be provided, indicate preferred)Proof of own contributio",
      "sectors": "finance, services, enterprise"
    },
    {
      "name": "Get to know about us",
      "summary": "A catalyst for sustainable innovative economic growth and development",
      "source": "https://www.lieda.co.za/",
      "eligibility": "",
      "fundingAmount": "R4.7 billion; 7 billion",
      "deadlines": "open",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "fourth furnace to enable down-stream value chain manufacturing including photovoltaic cells for the manufacturing of solar panels; 4.7 billion over 15 years Static overlay DIGITAL MEDIA CENTRE, FIRM AND TV PRODUCTION STUDIOS AND ACADEMY AT THE PETER MOKABA STADIUM IN POLOKWANE Re-purposing Peter Mokaba Stadium into multi-use film a",
      "sectors": "mining, agriculture, manufacturing, construction, technology, energy, innovation"
    },
    {
      "name": "Programs",
      "summary": "MINING AND BENEFICIATION INDUSTRIES",
      "source": "https://www.lieda.co.za/index.php/programs/",
      "eligibility": "",
      "fundingAmount": "R56 ",
      "deadlines": "rolling",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "2. Expansion of manufacturing through Industrial Parks Industrial Parks remain the most critical anchors for rural and township economies; Fourth Industrial Revolution; 3. Fetakgomo – Tubatse Special Economic Zone The changing global nature and the future outlook of products and services for immediate and future consumption dictate an investment strategy that developin; secondary industries is at the heart of Limpopo Province agro-processing strategies; first world countries",
      "sectors": "enterprise, finance, manufacturing, mining, services, education, energy, technology, agriculture, agricultural, construction, transport, innovation"
    },
    {
      "name": "Enterprise Development and Finance Division",
      "summary": "Strategic Objective: \"An increase in sustainable enterprises in targeted sectors of the economy.\"",
      "source": "https://www.lieda.co.za/index.php/enterprise-development-and-finance-division/",
      "eligibility": "",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "",
      "sectors": "enterprise, finance, services"
    },
    {
      "name": "Business Loan",
      "summary": "LEDA",
      "source": "https://www.lieda.co.za/index.php/business-loan/",
      "eligibility": "ICATION CRITERIA FOR BUSINESS LOAN (LONG-TERM LOAN) |",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "",
      "sectors": ""
    },
    {
      "name": "Procurement Loan",
      "summary": "LEDA",
      "source": "https://www.lieda.co.za/index.php/procurement-loan/",
      "eligibility": "ICATION CRITERIA FOR PROCUREMENT LOAN/ORDER (ONE MONTH) |",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "",
      "sectors": ""
    },
    {
      "name": "Home - MEGA",
      "summary": "– Premier DD Mabuza, Mpumalanga, 2014",
      "source": "https://mega.gov.za/",
      "eligibility": "Build preferential trade agreements Participate in foreign/local trade fairs Build relationships Manage inward/outward trade missions",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "1. In the Slider Settings -> Troubleshooting set option: Put JS Includes To Body option to true; 2. Find the double jquery; provide funding for SMMEs and cooperatives, and deliver housing finance, so as to foster the growth and development of Mpumalanga’s economy.  to  WHY MPUMALANGA? Mpumalanga offers a strategic location in the world market and in the South African economy, together with modern infrastructure and cutting-edge technology.  to  OUR NEW ONLINE APP Go to the Application View Brochure MEGA’S OPERATION AREAS FUNDING Provide funding for SMMEs and cooperatives Deliver housing finance Provide funding for agriculture and agro-processing  to  INVESTMENT Provide market information Facilitate feasibility studies Assist with applications for incentives Assist with claims for relocation costs Assist with work permits Obtain factory space and land Obtain finance Facilitate joint ventures Fast-track applications  to  TRADE PROMOTION Provide market information Handle import/export enquiries Create export incentives Handle customs duties Handle tariff headings Handle foreign trade requirements Build preferential trade agreements Participate in foreign/local trade fairs Build relationships Manage inward/outward trade missions  to  PROPERTY DEVELOPMENT AND MANAGEMENT MEGA’s Property Development and Management Programme is geared to build and maintain a property portfolio that can a) generate income, b) help to achieve organisational sustainability and c) facilitate employment creation.  to  MEGA PARTNERS #wpls-logo-showcase-slider-1 .wpls-fix-box, #wpls-logo-showcase-slider-1 .wpls-fix-box img.wp-post-image{max-height:250px; } 12345 {\"prefetch\":[{\"source\":\"document\",\"where\":{\"and\":[{\"href_matches\":\"\\/*\"},{\"not\":{\"href_matches\":[\"\\/wp-*",
      "sectors": "finance, technology, agriculture"
    },
    {
      "name": "COVID-19 RELIEF FUND - MEGA",
      "summary": "Applications call for Joint DSAC-DSBD COVID-19 Relief Fund for the Visual Arts, Craft and Design Sector",
      "source": "https://mega.gov.za/covid-19-relief-fund/",
      "eligibility": "– Click to View / Download English Affidavit – Click to View / DownloadApplication Form (Individuals) – Click to View / DownloadApplication Form (Organisations) – Click to View / DownloadCall to the Sector & Criteria – Click to View / Download IsiNdebele Affidavit – Click to View / DownloadApplication Form (Individuals) – Click to View / DownloadApplication Form (Organisations) – Click to View / DownloadCall to the Sector & Criteria – Click to View / Download IsiXhosa Affidavit – Click to View /",
      "fundingAmount": "",
      "deadlines": "closing date (Monday, 8 February 2021); 3 February 2021; 8 February 2021; open",
      "contactEmail": "",
      "contactPhone": "013 755 6328",
      "applicationProcess": "1. Only Close corporations (CC), Private companies and Co-operatives with requisite documentation; to apply for the Relief Fund; DownloadApplication Form (Individuals) – Click to View / DownloadApplication Form (Organisations) – Click to View / DownloadCall to the Sector & Criteria – Click to View / Download English Affidavit – Click to View / Downloa; DownloadApplication Form (Organisations) – Click to View / DownloadCall to the Sector & Criteria – Click to View / Download IsiNdebele Affidavit – Click to View / DownloadApplication Form (Individuals) – Click to View / Down; DownloadCall to the Sector & Criteria – Click to View / Download IsiXhosa Affidavit – Click to View / DownloadApplication Form (Individuals) – Click to View / DownloadApplication Form (Organisations) – Click to View / DownloadCall to the Sector & Criteria – Click to View / Download IsiZulu Affidavit – Click to View / Downloa",
      "sectors": ""
    },
    {
      "name": "FINANCE CALCULATOR - MEGA",
      "summary": "02 Eastern Boulevard, Riverside, Mbombela, 1201",
      "source": "https://mega.gov.za/finance-calculator/",
      "eligibility": "",
      "fundingAmount": "R60,000",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "0042005200",
      "applicationProcess": "First payment date:JanFebMarAprMayJunJulAugSepOctNovDec 2004200520062007200820092010201120122013201420152016201720182019202020212022202320242025202620272028202920302031203220332034Amortization:show by year",
      "sectors": "finance"
    },
    {
      "name": "KEY PROGRAMMES￼ - MEGA",
      "summary": "All Trade and Investment related enquiries can be directed to: trade-invest@mega.gov.za",
      "source": "https://mega.gov.za/key-programmes%ef%bf%bc/",
      "eligibility": "",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "trade-invest@mega.gov.za",
      "contactPhone": "",
      "applicationProcess": "",
      "sectors": ""
    },
    {
      "name": "Funding - MEGA",
      "summary": "We fund SMMEs and businesses that specialize in agro-processing, mining, energy, manufacturing, construction, trade, transport, forestry, services, government and community.",
      "source": "https://mega.gov.za/funding/",
      "eligibility": "",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "",
      "sectors": "mining, energy, manufacturing, construction, transport, services"
    },
    {
      "name": "NWDC – The Centre of Trade, Investment and Economic Growth",
      "summary": "We publish the Pulse e-newsletter every quarter. Complete the form to receive the latest news straight in your inbox.",
      "source": "https://nwdc.co.za/",
      "eligibility": "",
      "fundingAmount": "",
      "deadlines": "",
      "contactEmail": "",
      "contactPhone": "",
      "applicationProcess": "Complete the form to receive the latest news straight in your inbox",
      "sectors": "finance, enterprise"
    }
  ]
}